tangyangguang/FarmAuto/lib/Esp32MotorCurrentGuard/test/test_motor_current_guard.cpp
#include <cassert>
#include <cstdint>

#include "Esp32MotorCurrentGuard.h"

using namespace Esp32MotorCurrentGuard;

int main() {
  Ina240A2AnalogConfig inaConfig;
  inaConfig.amplifierGain = 50.0f;
  inaConfig.senseResistorMilliOhm = 5.0f;
  inaConfig.zeroOffsetMv = 1650;
  assert(currentMaFromIna240A2Voltage(inaConfig, 1900) == 1000);
  assert(currentMaFromIna240A2Voltage(inaConfig, 1400) == -1000);

  MotorCurrentGuard guard;

  MotorCurrentGuardConfig config;
  config.enabled = true;
  config.warningThresholdMa = 700;
  config.faultThresholdMa = 1000;
  config.startupGraceMs = 0;
  config.confirmationSamples = 2;
  config.confirmationMs = 0;
  config.filterAlpha = 1.0f;

  assert(guard.configure(config) == CurrentGuardResult::Ok);

  CurrentSample normal;
  normal.timestampMs = 10;
  normal.sequence = 1;
  normal.currentMa = 500;
  assert(guard.update(normal, 10) == CurrentGuardResult::Ok);
  assert(guard.snapshot().state == CurrentGuardState::Normal);

  CurrentSample over;
  over.timestampMs = 20;
  over.sequence = 2;
  over.currentMa = 1200;
  assert(guard.update(over, 20) == CurrentGuardResult::Ok);
  assert(guard.snapshot().state == CurrentGuardState::Warning);

  over.timestampMs = 30;
  over.sequence = 3;
  assert(guard.update(over, 30) == CurrentGuardResult::FaultActive);
  assert(guard.snapshot().state == CurrentGuardState::Fault);
  assert(guard.latestTracePoint().faultReason == CurrentFaultReason::OverCurrent);

  normal.timestampMs = 40;
  normal.sequence = 4;
  assert(guard.update(normal, 40) == CurrentGuardResult::FaultActive);
  assert(guard.snapshot().state == CurrentGuardState::Fault);

  guard.reset();
  assert(guard.snapshot().state == CurrentGuardState::Normal);

  return 0;
}
